mmark1999/F4/Lab_1/LCD_MATRIX/LCD_MATRIX.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F7
ProjectManager.MainLocation=Core/Src
RCC.I2SFreq_Value=96000000
ProjectManager.ProjectFileName=LCD_MATRIX.ioc
RCC.SAI1Freq_Value=96000000
PE14.GPIOParameters=GPIO_Label
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F756ZGTx
PE11.GPIOParameters=GPIO_Label
Mcu.PinsNb=15
ProjectManager.NoMain=false
PE11.GPIO_Label=KB_PC2_IN_RIGHT
RCC.PLLCLKFreq_Value=96000000
RCC.PLLQCLKFreq_Value=96000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
ProjectManager.DefaultFWLocation=true
PE14.GPIO_Label=LCD_DATA_5
PF14.GPIO_Label=KB_PC3_OUT_row1
RCC.PLLI2SRCLKFreq_Value=96000000
ProjectManager.DeletePrevious=true
PG14.GPIOParameters=GPIO_Label
PB10.Locked=true
RCC.LCDTFToutputFreq_Value=48000000
PG14.Locked=true
PF13.GPIO_Label=KB_PC0_IN_LEFT
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
ProjectManager.StackSize=0x400
PE9.GPIOParameters=GPIO_Label
PE15.GPIOParameters=GPIO_Label
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP2=RCC
Mcu.IP3=SYS
Mcu.IP0=CORTEX_M7
Mcu.IP1=NVIC
PE15.GPIO_Label=LCD_DATA_6
Mcu.UserConstants=
ProjectManager.TargetToolchain=STM32CubeIDE
PB10.GPIO_Label=LCD_DATA_7
RCC.SDMMCFreq_Value=16000000
PE7.GPIOParameters=GPIO_Label
Mcu.ThirdPartyNb=0
PB7.GPIOParameters=GPIO_Label
Mcu.IPNb=4
ProjectManager.PreviousToolchain=STM32CubeIDE
PF15.Locked=true
RCC.SPDIFRXFreq_Value=96000000
Mcu.Pin6=PE11
RCC.SAI2Freq_Value=96000000
Mcu.Pin7=PE12
ProjectManager.RegisterCallBack=
PE10.Locked=true
Mcu.Pin8=PE13
RCC.USBFreq_Value=96000000
Mcu.Pin9=PE14
RCC.VCOSAIOutputFreq_Value=192000000
RCC.PLLSAIoutputFreq_Value=96000000
PE11.Signal=GPIO_Output
RCC.LSE_VALUE=32768
PE9.GPIO_Label=KB_PC1_IN_CENTER
Mcu.Pin0=PF13
Mcu.Pin1=PF14
PE14.Locked=true
GPIO.groupedBy=
Mcu.Pin2=PF15
PB10.Signal=GPIO_Output
Mcu.Pin3=PE7
Mcu.Pin4=PE9
RCC.VCOI2SOutputFreq_Value=192000000
Mcu.Pin5=PE10
RCC.PLLSAIRCLKFreq_Value=96000000
ProjectManager.ProjectBuild=false
PG14.Signal=GPIO_Output
RCC.HSE_VALUE=25000000
PE13.GPIOParameters=GPIO_Label
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.PLLSAIPCLKFreq_Value=96000000
board=custom
RCC.VCOOutputFreq_Value=192000000
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
PF14.GPIOParameters=GPIO_Label
ProjectManager.FirmwarePackage=STM32Cube FW_F7 V1.16.0
MxDb.Version=DB.6.0.10
PE15.Locked=true
PE14.Signal=GPIO_Output
PE13.Signal=GPIO_Output
PE15.Signal=GPIO_Output
ProjectManager.BackupPrevious=false
MxCube.Version=6.1.1
RCC.VCOInputFreq_Value=1000000
PE9.Signal=GPIO_Output
RCC.PLLI2SPCLKFreq_Value=96000000
PE9.Locked=true
RCC.RNGFreq_Value=96000000
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
PF13.Locked=true
PF15.GPIO_Label=KB_PC5_OUT_row3
PB7.Signal=GPIO_Output
PF15.Signal=GPIO_Output
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF14.Locked=true
PF13.Signal=GPIO_Output
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PE7.Locked=true
PG14.GPIO_Label=KB_PC6_OUT_row4
ProjectManager.FreePins=false
RCC.IPParameters=CECFreq_Value,FamilyName,HSE_VALUE,HSI_VALUE,I2SFreq_Value,LCDTFToutputFreq_Value,LSE_VALUE,LSI_VALUE,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLQCLKFreq_Value,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PLLSAIRCLKFreq_Value,PLLSAIoutputFreq_Value,RNGFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,USBFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value
PE11.Locked=true
PE10.Signal=GPIO_Output
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F756ZGTx
PE7.GPIO_Label=LCD_RS
RCC.PLLI2SQCLKFreq_Value=96000000
ProjectManager.HalAssertFull=false
PE12.Signal=GPIO_Output
ProjectManager.ProjectName=LCD_MATRIX
ProjectManager.UnderRoot=true
PE13.Locked=true
ProjectManager.CoupleFile=false
PB7.GPIO_Label=LED_BLUE
Mcu.Package=LQFP144
PE13.GPIO_Label=KB_PC4_OUT_row2
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PE10.GPIOParameters=GPIO_Label
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PE12.GPIO_Label=LCD_DATA_4
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin13=PB7
PF13.GPIOParameters=GPIO_Label
Mcu.Pin14=VP_SYS_VS_Systick
ProjectManager.ComputerToolchain=false
RCC.HSI_VALUE=16000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PB10
Mcu.Pin12=PG14
Mcu.Pin10=PE15
RCC.CECFreq_Value=32786.88524590164
PF14.Signal=GPIO_Output
PB7.Locked=true
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB10.GPIOParameters=GPIO_Label
PE12.GPIOParameters=GPIO_Label
PE7.Signal=GPIO_Output
PE10.GPIO_Label=LCD_E
PF15.GPIOParameters=GPIO_Label
PE12.Locked=true
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32F756ZGTx
ProjectManager.LibraryCopy=1
RCC.PLLSAIQCLKFreq_Value=96000000
